#include <iostream>

#include "FriendFunction.h"
#include "Fraction.h"

using namespace std;

int main() {

    // Приклад використання класу Box та дружньої функції printWidth
    {
        Box box(10.6);
        printWidth(box); // Виклик дружньої функції для доступу до приватного члена
    }

    // Приклад використання класу Fraction та перевантаження оператора +
    {
        // Приклад використання класу Fraction
        Fraction f1(1, 2); // 1/2
        Fraction f2(3, 4); // 3/4

        // Додавання двох дробів (без перевантаження)
        Fraction result = Fraction::add(f1, f2);
        Fraction::printFraction(result); // Виведення результату

        // Додавання двох дробів (з перевантаженням оператора +)
        Fraction f3 = f1 + f2; // Використання оператора +
        Fraction::printFraction(f3); // Виведення результату оператора +
    }

    // Приклад використання перевантаження унарних операторів
    {
        Fraction f1(1, 2); // 1/2

        Fraction::printFraction(-f1); // Використання унарного оператора -
        Fraction::printFraction(++f1); // Використання префіксного оператора ++
        Fraction::printFraction(f1++); // Використання постфіксного оператора ++
    }

    // Приклад використання перевантаження оператора + для додавання цілого числа до дробу
    {
        Fraction f(1, 2);

        // Додавання цілого числа до дробу
        Fraction result = 2 + f; // Використання перевантаженого оператора +
        Fraction::printFraction(result); // Виведення результату
    }

    // Приклад використання перевантаження оператора ==
    {
        Fraction f1(1, 2); // 1/2
        Fraction f2(2, 4); // 2/4

        cout<<(f1 == f2 ? "Equal." : "Not equal.") << '\n';
    }

    // Приклад використання операторів << та >>
    {
        Fraction f(1, 2);
        cout << "Fraction: " << f << '\n'; // Використання перевантаженого оператора <<
        
        Fraction f2(0, 0); // Створення дробу з нульовим знаменником
        cin >> f2; // Використання перевантаженого оператора >>
        cout << "Fraction after input: " << f2 << '\n'; // Виведення дробу після введення
    }

    // Використання конструктора копіювання та оператора присвоєння
    {
        Fraction f1(1, 2); // 1/2

        Fraction f2 = f1; // Використання конструктора копіювання

        Fraction f3(0, 0);
        f3 = f1; // Використання оператора присвоєння
    }

    return 0;
}